In [1]:
# important first import pandas and numpy
import pandas as pd
import numpy as np
import os


# To connect with daba base
from sqlalchemy import create_engine

In [2]:
# Create connection
sqlitedb_path = '../data/raw/emiliopatio.db'
engine = create_engine(f'sqlite:///{sqlitedb_path}')

In [3]:
# list all tables in database

pd.read_sql_query("SELECT * FROM sqlite_master WHERE type='table'", engine)

,type,name,tbl_name,rootpage,sql
0,table,rank_info,rank_info,2,CREATE TABLE rank_info (\n\tid BIGINT NOT NULL...
1,table,personal_info,personal_info,34,CREATE TABLE personal_info (\n\tid BIGINT NOT ...
2,table,business_info,business_info,155,CREATE TABLE business_info (\n\tid BIGINT NOT ...

In [4]:
# 1. Read tables and go to dataframe
# 2. Merge personal and business dataframes
# 3. Merge personal,business and rank dataframes
# 4. Call to function


def init_table():
    business = pd.read_sql_query("SELECT * FROM business_info", engine)
    personal = pd.read_sql_query("SELECT * FROM personal_info", engine)
    rank = pd.read_sql_query("SELECT * FROM rank_info", engine)
    # remove null values from column "position" df range 
    # since if it does not give warning of the type SettingwithCopyWarning
    rank = rank.dropna()
    df_merge_personal_and_business = pd.merge(personal, business, on='id')
    df_all = pd.merge(df_merge_personal_and_business, rank, on='id')
    return df_all
df_all = init_table()

In [5]:

# Save all tables to CSV file
def save_table(df):
    
    df_all.to_csv('df_all.csv')
    return 

# Call function
save_table(df_all)
df_all

,id,lastName,age,Unnamed: 0_x,gender,country,image,Unnamed: 0_y,Source,worth,worthChange,realTimeWorth,realTimePosition,name,position,Unnamed: 0
0,2813,beZOs,54 years old,52,M,None,https://specials-images.forbesimg.com/imageser...,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1,jeff BEzos,1.0,52
1,8910,gaTES,62 years old,53,M,USA,https://specials-images.forbesimg.com/imageser...,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2,bilL GAtes,2.0,53
2,3919,BUFFETT,87 years old,54,M,United States,https://specials-images.forbesimg.com/imageser...,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3,warREN BUFfett,3.0,54
3,6449,arnAUlt,69 years old,55,M,France,https://specials-images.forbesimg.com/imageser...,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4,bernaRD ARNault,4.0,55
4,5032,zUCKERBerg,1985,56,None,None,https://specials-images.forbesimg.com/imageser...,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5,MARK ZUCKERBErg,5.0,56
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2203,2065,zHAO,51 years old,2255,None,None,https://specials-images.forbesimg.com/imageser...,2255,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,0.0 millions USD,None,2134,zhao xiAOQIANG,2204.0,2255
2204,2207,zhOU,55 years old,2256,Male,None,https://specials-images.forbesimg.com/imageser...,2256,Manufacturing ==> electrical equipment,1.0 BUSD,nan millions USD,None,2134,zhou liANGZHANg,2205.0,2256
2205,3442,zHU,51 years old,2257,M,None,https://specials-images.forbesimg.com/imageser...,2257,Manufacturing ==> electrical equipment,1.0 BUSD,0.0 millions USD,None,1856,zhu XINGMINg,2206.0,2257
2206,8144,ZHUO,52 years old,2258,F,Hong Kong,https://specials-images.forbesimg.com/imageser...,2258,Manufacturing ==> printed circuit boards,1.0 BUSD,0.0 millions USD,None,1978,zhUO Jun,2207.0,2258
2207,9807,ZORLu,54 years old,2259,M,None,https://specials-images.forbesimg.com/imageser...,2259,Diversified ==> diversified,1.0 BUSD,nan millions USD,None,1978,oLGUN ZORLU,2208.0,2259

In [14]:
def delete_columns():
    # define valid columns
    valid_columns = ['id', 'age','worth','lastName', 'position']
    # create new df with valid columns
    data = df_all[[x for x in df_all.columns if x in valid_columns]]
    
    return data

data = delete_columns()
data

        id    lastName           age       worth  position
0     2813       beZOs  54 years old  112.0 BUSD       1.0
1     8910       gaTES  62 years old   90.0 BUSD       2.0
2     3919     BUFFETT  87 years old   84.0 BUSD       3.0
3     6449     arnAUlt  69 years old   72.0 BUSD       4.0
4     5032  zUCKERBerg          1985   71.0 BUSD       5.0
...    ...         ...           ...         ...       ...
2203  2065        zHAO  51 years old    1.0 BUSD    2204.0
2204  2207        zhOU  55 years old    1.0 BUSD    2205.0
2205  3442         zHU  51 years old    1.0 BUSD    2206.0
2206  8144        ZHUO  52 years old    1.0 BUSD    2207.0
2207  9807       ZORLu  54 years old    1.0 BUSD    2208.0

[2208 rows x 5 columns]

In [15]:
# Remove column text
# See the WARNING in https://www.dataquest.io/blog/settingwithcopywarning/
def replace_text():
    data.loc[:,'worth'] = data['worth'].str.replace('BUSD', '')
    data.loc[:,'age'] = data['age'].str.replace('years old', '')
    data.rename(columns={'worth': 'worth 2019 in BUSD'}, inplace = True)
    return data

data = replace_text()
data

        id    lastName   age worth 2019 in BUSD  position
0     2813       beZOs   54              112.0        1.0
1     8910       gaTES   62               90.0        2.0
2     3919     BUFFETT   87               84.0        3.0
3     6449     arnAUlt   69               72.0        4.0
4     5032  zUCKERBerg  1985              71.0        5.0
...    ...         ...   ...                ...       ...
2203  2065        zHAO   51                1.0     2204.0
2204  2207        zhOU   55                1.0     2205.0
2205  3442         zHU   51                1.0     2206.0
2206  8144        ZHUO   52                1.0     2207.0
2207  9807       ZORLu   54                1.0     2208.0

[2208 rows x 5 columns]

In [16]:
def delete_column_text():
    data['lastName'] = data['lastName'].apply(lambda x: x.lower())
    return data

data = delete_column_text()
data

/home/emilio/miniconda3/envs/test_env/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

        id    lastName   age worth 2019 in BUSD  position
0     2813       bezos   54              112.0        1.0
1     8910       gates   62               90.0        2.0
2     3919     buffett   87               84.0        3.0
3     6449     arnault   69               72.0        4.0
4     5032  zuckerberg  1985              71.0        5.0
...    ...         ...   ...                ...       ...
2203  2065        zhao   51                1.0     2204.0
2204  2207        zhou   55                1.0     2205.0
2205  3442         zhu   51                1.0     2206.0
2206  8144        zhuo   52                1.0     2207.0
2207  9807       zorlu   54                1.0     2208.0

[2208 rows x 5 columns]

In [17]:
def change_column_type(data):
    object_column = list(data.loc[:, data.dtypes == np.object])
    
    for i in object_column:
        if i != 'lastName':
            data[i] = pd.to_numeric(data[i])
        
    return data
data = change_column_type(data)
data

/home/emilio/miniconda3/envs/test_env/lib/python3.7/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

        id    lastName     age  worth 2019 in BUSD  position
0     2813       bezos    54.0               112.0       1.0
1     8910       gates    62.0                90.0       2.0
2     3919     buffett    87.0                84.0       3.0
3     6449     arnault    69.0                72.0       4.0
4     5032  zuckerberg  1985.0                71.0       5.0
...    ...         ...     ...                 ...       ...
2203  2065        zhao    51.0                 1.0    2204.0
2204  2207        zhou    55.0                 1.0    2205.0
2205  3442         zhu    51.0                 1.0    2206.0
2206  8144        zhuo    52.0                 1.0    2207.0
2207  9807       zorlu    54.0                 1.0    2208.0

[2208 rows x 5 columns]

In [18]:
# Save first clean table to CSV file
def save_table(df):
    
    data.to_csv('data.csv')
    return 

# Call function
save_table(data)

In [19]:
data.dtypes

id                      int64
lastName               object
age                   float64
worth 2019 in BUSD    float64
position              float64
dtype: object

In [11]:
# pasar a int o float all columns 
# descargar el df de fortune 500